[
  {
    "title": "Japanese Cream Stew",
    "serves": "4-6",
    "ingredients": "Dash of oil, 400g chicken thigh fillet (diced), 1 onion (diced), 3 potatoes (diced), 4 carrots (diced), 1 broccoli (cut small), 2 tsp chicken stock powder, 2 cups water, 1/3 cup flour, 2 Tbsp butter, 3 cups milk, 30g grated cheese",
    "method": "Heat a little oil in a large saucepan.  Saute onions until softened.  Add Chicken and stir until browned over high heat. Add potatoes, chicken stock and water.  Bring to boil and simmer. Meanwhile, peel and slice carrots into triangular chunks.  Add to saucepan.  Simmer.  There should be just enough liquid to cook everything, not too much. Meanwhile, prepare the cream roux: In a medium saucepan, melt butter over low heat. Add 1/4 cup of milk and the flour.  Whisk until smooth, over low heat.  Add the rest of the milk gradually, while whisking. Continue stirring, increasing the heat until the mixture thickens and bubbles.  Add cheese if desired. Add the cream roux to the stew, add broccoli, and bring to a gentle boil one more time.  Taste and season with salt and pepper.",
    "url": "http://2.bp.blogspot.com/-kRCAxmA6Gvg/Tm4OXcMo9KI/AAAAAAAAAQ4/xi-g4XNV29c/s640/DSC_2713.jpg "
  },
  {
    "title": "Gyudon (Japanese Beef Bowl)",
    "serves": "4",
    "ingredients": "2 cups boiling water, 2 tsp Dashi powder, 1-2 Onions (sliced), 400g Beef (thinly sliced), 1/4 cup Sugar, 1/4 cup Sake (optional), 1/3 cup Japanese Soy Sauce, 1/2 tsp grated fresh Ginger, steamed rice (to serve) and Beni-shoga (garnish)",
    "method": "Place water, dashi powder and onions in a saucepan and boil 3 min. Add sugar, sake, soy sauce, beef, and stir to combine well. Bring to the boil and simmer 10min. Stir in freshly grated ginger and simmer another 5-10 min until beef has absorbed the flavour, onions are caramelised and liquid is reduced to half. Serve on a bowl of steamed rice and top with beni-shoga if desired.",
    "url": "http://3.bp.blogspot.com/-DcXGT8ipr7I/TxAIEVm2zGI/AAAAAAAAA_U/PD5Qqz0qPkk/s640/Gyudon+by+Little+Japan+Mama2.jpg"
  },
  {
    "title": "Pork Ginger Stir-Fry",
    "serves": "2-3",
    "ingredients": "300g thinly sliced pork,1 piece of fresh ginger, 1 carrot, 1 onion, 1 eggplant, 3 piiman (or 1 green capsicum/bell pepper), 3 Tbsp soy sauce, 3 Tbsp sake, 2 Tbsp sugar, 1 Tbsp cornstarch or katakuriko, dissolved in about 100ml water, vegetable oil, a little sesame oil",
    "method": "Heat about 2 Tbsp oil in a wok or frypan.  Grill the sliced onion, eggplant and bell pepper until the onion is fragrant and the eggplant and bell pepper have a slight grilled look.  Remove and set aside.  Rinse the wok with a little water. Heat another 2 Tbsp oil in the wok.  Add the pork and turn it just enough to allow the pork to have golden-brown marks.  Add the ginger and carrots, sake, soy sauce and sugar, and cover with a lid until carrots have softened. Add the grilled vegetables, sesame oil and cornstarch mixture.  Heat, stirring, until the sauce thickens.",
    "url": "http://4.bp.blogspot.com/-3CjjjJjpwQg/UinTLLII5OI/AAAAAAAACVw/G75J1HclN4Q/s640/Pork+Ginger+Stir-fry+Recipe+4.jpg"
  }
]
